[
    {"name":"Hero Index","skills":["React","Bootstrap","Axios","JavaScript","HTML","CSS","Superhero API"],"imageSlides":{"pic1ID":"assets/heroIndexSlide1.png","pic2ID":"assets/heroIndexSlide2.png","pic3ID":"assets/heroIndexSlide3.png"},"picID":"assets/heroIndex2.png","description":"Created a React app where the user can search up any hero and retrieve information on them like: biography, appearance, powerstats, etc. This is done by using Axios to fetch a json object from Superhero API containing all the results matching the query. Once the user searchs up a name the first time, the site will then lead to the result page where you can view all the results and also including a live search where the user can search any name and the results will update with it","githubLink":"https://zainafzal0.github.io/hero-index"},
    {"name":"Street Brawlers","skills":["Java","Java AWT","OOP"],"imageSlides":{"pic1ID":"assets/streetFighterSlide1.png","pic2ID":"assets/streetFighterSlide2.png","pic3ID":"assets/streetFighterSlide3.png"},"picID":"assets/streetFighter.png","description":"This project was developed solely with Java and Java AWT as an experience to become more proficient with the language. At the start the user is given four different selection of maps to choose from. The game includes only two characters and is meant for two players. Various different animations were used to produce a nostalgic and clean UI. The project ultilized all 4 pillars of Object Oriented programming. ","githubLink":"https://github.com/zainafzal0/Street-Brawler"},
    {"name":"Connect Four","skills":["Java","Android Studio"],"imageSlides":{"pic1ID":"assets/connectFourSlide1.png","pic2ID":"assets/connectFourSlide2.png","pic3ID":"assets/connectFourSlide3.png"},"picID":"assets/connectFour.png","description":"This Connect Four app was developed using Java and Android Studio. The game requires two players to play. A clean user interface was designed and multiple different animations were used such as: dropping a piece and flashing pieces if four connected and user won. Currently I am working on adding a single player mode by implementing the minimax algorithm. ","githubLink":"https://github.com/zainafzal0/ConnectFour"}
]